const COUNTRIES = {
    QA: {
        label: "قطر 🇶🇦",
        stages: {
            E: "الابتدائية",
            P: "الإعدادية",
            S: "الثانوية"
        }
    },
    JO: {
        label: "الأردن 🇯🇴",
        stages: {
            B: "المرحلة الأساسية",
            S: "المرحلة الثانوية"
        }
    },
    SA: {
        label: "السعودية 🇸🇦",
        stages: {
            E: "الابتدائية",
            I: "المتوسطة",
            S: "الثانوية"
        }
    }
};

const SUBJECTS = [
    'العربية','الإنجليزية','الرياضيات','التربية الإسلامية',
    'العلوم','الاجتماعيات','الفيزياء',
    'الكيمياء','الأحياء','الحاسوب'
];

const GRADES_BY_STAGE = {
    QA: {
        E: [1,2,3,4,5,6],
        P: [7,8,9],
        S: [10,11,12]
    },
    JO: {
        B: [1,2,3,4,5,6,7,8,9],
        S: [10,11,12]
    },
    SA: {
        E: [1,2,3,4,5,6],
        I: [7,8,9],
        S: [10,11,12]
    }
};